<template>
  <div class="container">
    <rich-text :nodes="content" space="nbsp"></rich-text>
  </div>
</template>


<script>
export default {
  data() {
    return {
      content: `
<h4 style="color: #00f; text-align: center">欢迎来到动亿动微信小程序</h4>
<br>
<h4>下面介绍一下小程序的主要功能：</h4>
<p>    1、	查看最近体质健康检测成绩</p>
<p>点击“我的”   “设置” 正确输入学生学号和测试时的学校和年级，回到“首页”点击“体质报告”即可查看到体质健康测试成绩。</p>
<p>    2、	根据成绩查看及专家建议</p>
<p>在完成体质健康测试后，根据测试成绩在“体质报告”最下方，会给出成绩评估和专家建议供参考。</p>
<p>    3、	青少年提高体质健康的教学视频</p>
<p>在“课程”里提供了提高体质健康的教学视频供参照学习，这里可以将认为适合自己的视频加入到训练计划里，可以在“训练”里直接查看练习。</p>
<p>    4、	青少年如何提高体质健康的常识</p>
<p>在“动态”里提供了青少年健康成长的一些常识供参考。</p>
<h4 style="color: #f00">需要注意的几点：</h4>
<p>    1、	必须正确输入学生的学号（通常是指在学校的学号或者学生的身份证号），否则将查不到您的成绩。</p>
<p>    2、	必须输入测试时的学生所在的年级，这样反映出的是测试时的成绩，否则成绩及判断将以输入的年级为准进行计算。</p>
<p>    3、	成绩评估及专家建议供学生参考，更主要的是希望学生尽快发现自己的不足，以进一步找到方法进行有效的锻炼提高。</p>
<p>    4、	如果您还有什么想法和建议，欢迎您在“反馈”里给我们留言，我们将认真对待，便于更好的为您提供服务。</p>
<br>
<h4>最后，感谢您的光临，我们将不辜负您的期望，为青少年体质健康的提高做出不懈的努力！</h4>
`
    };
  }
};
</script>


<style lang="scss" scoped>
.container {
  padding: 30rpx;
  line-height: 1.5em;
}
</style>
